### Python --> SQL

### Desde Python podemos conectarnos a SQL y modificar datos, insertar datos, etc.

-Conexión a BBDD
-Crear BBDD
-Crear una tabla
-Insertar datos
-Eliminar datos
-Actualizar datos

### Desde SQL también podremos después...
-Leer datos
-Comando de integración

In [1]:
#Importamos ciertas librerias (si nos da error lo hacemos con pip install)
import mysql.connector

In [3]:
pip install mysql-connector-python

Requirement already satisfied: mysql-connector-python in c:\users\rmart\appdata\local\programs\python\python311\lib\site-packages (9.1.0)
Note: you may need to restart the kernel to use updated packages.

[notice] A new release of pip is available: 24.0 -> 24.3.1
[notice] To update, run: python.exe -m pip install --upgrade pip

In [1]:
from mysql.connector import errorcode
import pandas as pd

In [ ]:
#Conectar a BBDD
#Creamos una variable que la llamamos como queramos, pero se suele llamar cnx
#Esto sirve para "conectarnos" a nuestra base de datos
#Usamos:
    #-mysql.coonector.connect
    #-Le pasamos los parámetros user, password y host y a veces, databse

cnx = mysql.connector.connect(user=, password=, host=, database=)

#Creamos un "cursor" al que le vamos a decir qué queremos cmabiar y demás

mycursor = cnx.cursor()

# Una vez hecho todo esto, haríamos las queries, selecciones, creaciones...
# PERO la sintaxis aquí es ligeramente diferente

#Hay varias opciones de ejecutar queries y podéis elegir la que más sencilla os parezca

#Opcion1
mycursor.execute('query') #Dentro puede haber un SELECT, CREATE...

#Opcion2

consulta = 'query'
mycursor.execute(consulta)

#Opcion3

consulta = 'query'
valores =('val1', 'val2')
mycursor.execute(consulta, valores)

#Los resultados los vamos a tener con comandos como:
fetchone()
fetchall()
commit()
cnx.close()

In [4]:
#Primero vamos a conectarnos al servidor de Adalab

cnx = mysql.connector.connect(user= 'root', password='AlumnaAdalab', host='127.0.0.1') #Usaremos este número que le dice al código
#que el servidor de SQL al que queremos acceder esta en esta misma máquina

#Ejecutamos el cursor

mycursor = cnx.cursor()

#Ejecutativos la query. IMPORTANTE aquí en vez de SCHEMA utiliamos DATABASE

mycursor.execute('CREATE DATABASE IF NOT EXISTS bd_prueba')

#Cerramos la conexión
#Esto es imporante porque cada conexión ocupa procesamiento, si hay muchas conexiones abiertas, el servidor podría sobrecargarse
cnx.close()


#El resultado lo veremos en Workbench, no aquí
#Entramos en Workbench, actualizamos las bases de datos y ahí nos debe aparecer

In [ ]:
#Ahora vamos a crear una tabla dentro de bd_prueba
#Podríamos conectarnos a otra base de datos, pero vamos a seguir con la misma

cnx = mysql.connector.connect(user= 'root', password='AlumnaAdalab', host='127.0.0.1', database = 'bd_pruebas')

mycursor = cnx.cursor()

#Aquí la sintaxis es algo diferente 

query = 'CREATE TABLE IF NOT EXISTS customers (name VARCHAR(255), address VARCHAR(255))'

mycursor.execute(query)

#Ejecutamos y vemos que efectivamente se ha creado la tabla

In [6]:
#Insertar un registro. Como no he cerrado la conexión, puedo seguir en la misma
#Además, voy a seguir utilizando el mismo cursor, lo cual es buena práctica

query2 = 'INSERT INTO customers (name, address) VALUES(%s, %s)' #El número de %s será el número de columnas
valores = ('Marta', 'Calle Eduardo Dato')
mycursor.execute(query2, valores)

In [ ]:
cnx.commit() 
#Este commit se usa después de operaciones que modifican los datos, es decir, con:
# INSERT, UPDATE y DELETE
# Si no lo ejecutamos, no confirmamos los cambios
# No hace falta para consultas como: SELECT
#Vamos a Workbench y probamos: SELECT * FROM bd_pruebas.customers

In [ ]:
mycursor = cnx.cursor()

query3 = 'INSERT INTO customers (name, address) VALUES(%s, %s)'
valores_nuevos = [
    ('Úrsula', 'Calle Campoamor'),
    ('Ana', 'Calle Ramón y Cajal'),
    ('Carla', 'Calle Amor de Dios'),
    ('Juana', 'Calle Begoña')   ]

mycursor.executemany(query3, valores_nuevos) #Para cuando más de 1 valor a insertar, usamos.executemany en vez de execute
cnx.commit()
cnx.close()

#Veamos si se han añadido a nuestra tabla...

In [6]:
#Veamos otra función

cnx = mysql.connector.connect(user= 'root', password='AlumnaAdalab', host='127.0.0.1', database = 'bd_pruebas')

mycursor = cnx.cursor()
query = 'INSERT INTO customers (name, address) VALUES(%s, %s)'
valores = ('Lucia', 'Calle Mayor')

mycursor.execute(query, valores)

#Imaginaos que lo ejecuto, pero me he dado cuenta de que me he equivocado y quiero revertirlo
#Entonces volvería a hacer el mismo código pero con rollback

cnx.rollback()

#Es decir, básicamente le decimos que no aplique nos cambios en la base de datos
#Es lo contrario del commit

In [ ]:
mycursor = cnx.cursor()

query = "DELETE FROM customers WHERE address = 'Calle Alcalá'"

mycursor.execute(query)

cnx.commit()

#Ejecutamos esto y cuando vayamos a Workbench habrá eliminado este registro

In [7]:
#Le digo que me asigne otro valor
mycursor = cnx.cursor()

query = "UPDATE customers SET address = 'Calle Real' WHERE address = 'Calle Mayor'"

mycursor.execute(query)

cnx.commit()

In [ ]:
#Ahora voy a hacer una consulta, pero con otra base de datos. Voy a hacer una consulta en tienda

cnx = mysql.connector.connect(user= 'root', password = 'AlumnaAdalab', host = '127.0.0.1', database= 'tienda')
mycursor = cnx.cursor()
mycursor.execute('SELECT * FROM employees')

myresult = mycursor.fetchone() #Esto lo usamos cuando solo quiero ver la primera línea del resultado

print(myresult)

#La consulta la puedo ver aquí mismo

In [ ]:
#Y si quiero traer más de un resultado?

cnx = mysql.connector.connect(user= 'root', password = 'AlumnaAdalab', host = '127.0.0.1', database= 'tienda')
mycursor = cnx.cursor()
mycursor.execute('SELECT * FROM employees') 

myresult = mycursor.fetchall() #Esto es cuando quiero ver todas las líneas de los resultados

print(myresult)

In [10]:
#¿Cómo podemos ver los resultados más bonitos?
#Aquí tendríamos que pasarle el nombre de las columnas

import pandas as pd
df = pd.DataFrame(myresult, columns = ['id', 'nombre', 'apellido', 'email', 'telefono', 'direccion', 'ciudad', 'pais'])

In [ ]:
df

In [ ]:
#¿Cómo veíamos los primeros registros de un dataframe?
#¿Y los últimos?
#¿Y una muestra aleatoria?

In [ ]:
#También podemos usar
.describe()
.describe(include='object')
.isnull()
.isnull.sum()
.info()
.columns

In [ ]:
df.info()

In [ ]:
df.describe()

In [ ]:
df.describe(include='object')
#count: número de valores no nulos
#unique: valores únicos en la columna
#top: los valores que más se repiten
#freq: cuántas veces aparece el valor top

In [ ]:
cnx.close()

In [ ]:
cnx = mysql.connector.connect(user= 'root', password='AlumnaAdalab', host='127.0.0.1', database = 'leccion_crear_tablas')

mycursor = cnx.cursor()


query = "SELECT * FROM adalaber WHERE ciudad = 'Madrid' OR curso = 'Frontend'"

mycursor.execute(query)

results = mycursor.fetchall()

print(results)

In [ ]:
cnx = mysql.connector.connect(user= 'root', password='AlumnaAdalab', host='127.0.0.1', database = 'leccion_crear_tablas')

mycursor = cnx.cursor()


query = "SELECT * FROM adalaber WHERE conocimientos_previos IN ('Poco', 'Sin')"

mycursor.execute(query)

results = mycursor.fetchall()

print(results)

In [ ]:
cnx = mysql.connector.connect(user= 'root', password='AlumnaAdalab', host='127.0.0.1', database = 'leccion_crear_tablas')

mycursor = cnx.cursor()


query = "SELECT DISTINCT curso FROM adalaber"

mycursor.execute(query)

results = mycursor.fetchall()

print(results)

In [ ]:
cnx = mysql.connector.connect(user= 'root', password='AlumnaAdalab', host='127.0.0.1', database = 'leccion_crear_tablas')

mycursor = cnx.cursor()


query = "SELECT * FROM adalaber LIMIT 3"

mycursor.execute(query)

results = mycursor.fetchall()

print(results)

In [24]:
cnx.close()

In [41]:
try:
    cnx = mysql.connector.connect(user= 'root', password='AlumnaAdalab', host='127.0.0.1')
    print("Conexión establecida con éxito")
except mysql.connector.Error as err:
    print(f"Error al conectar con MySQL: {err}")

Conexión establecida con éxito

In [ ]:
try:
    mycursor = cnx.cursor()
    query = "CREATE DATABASE IF NOT EXISTS alumnas_promo_D"
    mycursor.execute(query)
    print("Query exitosa")
except:
    print("Error.")

In [33]:
mycursor.execute("USE alumnas_promo_D")

query = 'CREATE TABLE IF NOT EXISTS alumnas (id_alumna INT AUTO_INCREMENT PRIMARY KEY, nombre VARCHAR(100), apellidos VARCHAR(100), ciudad VARCHAR(100),telefono VARCHAR(15))'

mycursor.execute(query)

In [34]:
insert_query = " INSERT INTO alumnas (nombre, apellidos, ciudad, telefono) VALUES (%s, %s, %s, %s)"

values = ('Ana', 'González', 'Madrid', '600111222')

mycursor.execute(insert_query, values)
cnx.commit()

In [35]:
#También se podría hacer así, pero no son buenas prácticas en bases de datos importantes, ya que es un código más débil
#que puede sufrir ataques más fácilmente y podrían ejecutar acciones no autorizadas

insert_query = """
    INSERT INTO alumnas (nombre, apellidos, ciudad, telefono)
    VALUES
    ('Ana', 'González', 'Madrid', '600111222'),
    ('María', 'Pérez', 'Barcelona', '600333444'),
    ('Laura', 'López', 'Valencia', '600555666'),
    ('Clara', 'Martínez', 'Madrid', '600777888'),
    ('Sofía', 'Rodríguez', 'Sevilla', '600999000'),
    ('Eva', 'Fernández', 'Barcelona', '601234567'),
    ('Carmen', 'García', 'Valencia', '601345678'),
    ('Bea', 'Sánchez', 'Madrid', '601456789'),
    ('Isabel', 'Romero', 'Sevilla', '601567890'),
    ('Julia', 'Vázquez', 'Valencia', '601678901')
    """
mycursor.execute(insert_query)
cnx.commit()
cnx.close()

In [ ]:
#Cómo guardar solo los datos que he filtrado

cnx = mysql.connector.connect(user= 'root', password='AlumnaAdalab', host='127.0.0.1', database = 'alumnas_promo_d')

mycursor = cnx.cursor()


query = "SELECT * FROM alumnas WHERE ciudad = 'Madrid'"

mycursor.execute(query)

results = mycursor.fetchall()

print(results)

In [37]:
df_madrid = pd.DataFrame(results, columns= ['id', 'nombre', 'apellidos', 'ciudad', 'tlfn'])

In [ ]:
df_madrid

In [40]:
cnx.close()

In [6]:
import mysql.connector

# Establecer la conexión
cnx = mysql.connector.connect(
    user='root', 
    password='AlumnaAdalab', 
    host='127.0.0.1'
)

print("Conexión establecida con éxito")

Conexión establecida con éxito

In [7]:
mycursor = cnx.cursor()

In [8]:
query = "USE videoclub"
mycursor.execute(query)

In [10]:
query = "INSERT INTO clientes (nombre, apellido, direccion, telefono, email, fecha_registro) VALUES (%s, %s, %s, %s, %s, %s)"
values = [('Ana', 'Martínez', 'Calle Luna 101', '555-1122', 'ana.martinez@example.com', '2023-04-01'), ('Jorge', 'Ramírez', 'Av. Sol 202', '555-3344', 'jorge.ramirez@example.com', '2023-05-15'), ('María', 'Fernández', 'Calle Estrella 303', '555-5566', 'maria.fernandez@example.com', '2023-06-20'), ('Pedro', 'Sánchez', 'Av. Libertad 404', '555-7788', 'pedro.sanchez@example.com', '2023-07-10'), ('Sofía', 'Gómez', 'Calle Unión 505', '555-9900', 'sofia.gomez@example.com', '2023-08-25'), ('Luis', 'Torres', 'Av. Central 606', '555-2233', 'luis.torres@example.com', '2023-09-05'), ('Claudia', 'Ruiz', 'Calle Norte 707', '555-4455', 'claudia.ruiz@example.com', '2023-10-10'), ('Fernando', 'Vega', 'Av. Sur 808', '555-6677', 'fernando.vega@example.com', '2023-11-20'), ('Elena', 'Díaz', 'Calle Este 909', '555-8899', 'elena.diaz@example.com', '2023-12-01'), ('Ricardo', 'Morales', 'Av. Oeste 010', '555-0000', 'ricardo.morales@example.com', '2024-01-15')]
mycursor.executemany(query, values)

In [11]:
mycursor.execute('SELECT * FROM clientes')
myresults = mycursor.fetchall()

print(myresults)

[(1, 'Carlos', 'García', 'Av. Principal 123', '555-1234', 'carlos@example.com', datetime.date(2023, 1, 15)), (2, 'Lucía', 'Pérez', 'Calle Secundaria 45', '555-5678', 'lucia@example.com', datetime.date(2023, 2, 20)), (3, 'Miguel', 'Lopez', 'Av. Tercera 789', '555-9876', 'miguel@example.com', datetime.date(2023, 3, 10)), (4, 'Ana', 'Martínez', 'Calle Luna 101', '555-1122', 'ana.martinez@example.com', datetime.date(2023, 4, 1)), (5, 'Jorge', 'Ramírez', 'Av. Sol 202', '555-3344', 'jorge.ramirez@example.com', datetime.date(2023, 5, 15)), (6, 'María', 'Fernández', 'Calle Estrella 303', '555-5566', 'maria.fernandez@example.com', datetime.date(2023, 6, 20)), (7, 'Pedro', 'Sánchez', 'Av. Libertad 404', '555-7788', 'pedro.sanchez@example.com', datetime.date(2023, 7, 10)), (8, 'Sofía', 'Gómez', 'Calle Unión 505', '555-9900', 'sofia.gomez@example.com', datetime.date(2023, 8, 25)), (9, 'Luis', 'Torres', 'Av. Central 606', '555-2233', 'luis.torres@example.com', datetime.date(2023, 9, 5)), (10, 'Claudia', 'Ruiz', 'Calle Norte 707', '555-4455', 'claudia.ruiz@example.com', datetime.date(2023, 10, 10)), (11, 'Fernando', 'Vega', 'Av. Sur 808', '555-6677', 'fernando.vega@example.com', datetime.date(2023, 11, 20)), (12, 'Elena', 'Díaz', 'Calle Este 909', '555-8899', 'elena.diaz@example.com', datetime.date(2023, 12, 1)), (13, 'Ricardo', 'Morales', 'Av. Oeste 010', '555-0000', 'ricardo.morales@example.com', datetime.date(2024, 1, 15))]

In [12]:
import pandas as pd

In [14]:
df_videoclub = pd.DataFrame(myresults, columns = ['id', 'nombre', 'apellido', 'direccion', 'telefono', 'email', 'fecha_registro'])

In [15]:
df_videoclub

,id,nombre,apellido,direccion,telefono,email,fecha_registro
0,1,Carlos,García,Av. Principal 123,555-1234,carlos@example.com,2023-01-15
1,2,Lucía,Pérez,Calle Secundaria 45,555-5678,lucia@example.com,2023-02-20
2,3,Miguel,Lopez,Av. Tercera 789,555-9876,miguel@example.com,2023-03-10
3,4,Ana,Martínez,Calle Luna 101,555-1122,ana.martinez@example.com,2023-04-01
4,5,Jorge,Ramírez,Av. Sol 202,555-3344,jorge.ramirez@example.com,2023-05-15
5,6,María,Fernández,Calle Estrella 303,555-5566,maria.fernandez@example.com,2023-06-20
6,7,Pedro,Sánchez,Av. Libertad 404,555-7788,pedro.sanchez@example.com,2023-07-10
7,8,Sofía,Gómez,Calle Unión 505,555-9900,sofia.gomez@example.com,2023-08-25
8,9,Luis,Torres,Av. Central 606,555-2233,luis.torres@example.com,2023-09-05
9,10,Claudia,Ruiz,Calle Norte 707,555-4455,claudia.ruiz@example.com,2023-10-10
10,11,Fernando,Vega,Av. Sur 808,555-6677,fernando.vega@example.com,2023-11-20
11,12,Elena,Díaz,Calle Este 909,555-8899,elena.diaz@example.com,2023-12-01
12,13,Ricardo,Morales,Av. Oeste 010,555-0000,ricardo.morales@example.com,2024-01-15

In [16]:
python --version

NameError: name 'python' is not defined